{
    "myName": "SANTIAGO RUBIOL",
    "myTitle": "FULL STACK DEVELOPER (STACK MERN)",
    "spanish": {
        "aboutMe": "Egresado de la {/bUniversidad Tecnológica Nacional}, busco nuevos retos constantemente, me encanta ponerme a prueba y aprender cosas nuevas, soy una persona muy curiosa. Me apasionan las matemáticas. {/n} Cuento con sólidos conocimientos en la comprensión de algoritmos complejos y versatilidad y lógica para resolver diversos problemas, respaldados por años de experiencia en programación. Soy una persona dispuesta y capaz de realizar cualquier tarea.",
        "laboralExperience": [
            {
                "title":"EMPRESA DE TRANSPORTE", 
                "rol": "Desarrollador y gerente administrativo", 
                "time": "Jul 2018 - Actualidad", 
                "text": "Desarrollé un sistema informático completo para la administración de una flota de taxis y control de repuestos en stock utilizando Java, con una base de datos MySQL. Cuenta a demás con un apartado de gestión de choferes, de gestión de vehículos y la posibilidad de visualizar los datos por mes, por día o por vehículo. Administré este sistema mientras lo perfeccionaba, controlaba cobros, actualizaba stock, etc. En 2023 capacité a dos personas en el uso del sistema."
            },
            {
                "title":"KMON", 
                "rol": "Gestión de flotas de vehículos", 
                "time": "Ene 2022 - May 2022", 
                "text": "Me dediqué exclusivamente a la administración de cuatro vehículos de transporte de pasajeros. En el tiempo que estuve diseñé un excel para controlar el número de kilómetros de los autos, el correcto pago a los conductores. A demás, me desenvolví atendiendo a los choferes ante los inconvenientes que sepresentaban para poder encontrar una solución."
            },
            {
                "title":"LO DE CE", 
                "rol": "Desarrollo de un sistema web", 
                "time": "Sep 2023 - Feb 2024", 
                "text": "Desarrollé un sistema de control de stock para una empresa de venta de ropa. A través de su uso, los trabajadores pueden ver diferentes prendas en inventario, cantidades, varias tallas y precios. No solo eso,también pueden verificar la lista de ventas actualizada, que incluye todo el proceso y la asociación de datos. Adicionalmente, se incorporó un módulo de cliente, que permite registrar su información personal, historial de compras y deudas acumuladas. Otra funcionalidad requerida fue la integración de un módulo de proveedor con su información de contacto, datos bancarios y otras utilidades. Usé React, node, mysql y lo implementé en Vercel"
            },
            {
                "title":"MI ODONTO", 
                "rol": "Desarrollo de un sistema web", 
                "time": "Oct 2023 - Actualidad", 
                "text": "Desarrollé un sistema de registro de pacientes para un dentista, cubriendo así una necesidad crítica de organización de la información y registro de los diferentes turnos y servicios que se prestan. El módulo de pacientes incluye toda la información inherente a ellos, destacando la selección y depuración por parte de la obra social. A través de esta innovadora solución, la profesional pudo visualizar en todo momento el estado de los turnos programados, junto con la información del turno y el paciente asociado."
            }
        ]

    },
    "english":{
        "aboutMe": "Graduated from the {/bNational Technological University}, I am constantly looking for new challenges, I love to test myself and learn new things, I am a very curious person. I am passionate about mathematics. {/n} I have solid knowledge in understanding complex algorithms and versatility and logic to solve various problems, backed by years of programming experience. I am a person willing and able to carry out any task."
    },
    
    
    "skills": [
        {
            "name": "Javascript",
            "image": "/skills/javascriptLogo.png"
        },
        {
            "name": "HTML",
            "image": "/skills/htmlLogo.png"
        },
        {
            "name": "CSS",
            "image": "/skills/cssLogo.png"
        },
        {
            "name": "Python",
            "image": "/skills/pythonLogo.png"
        },
        {
            "name": "JAVA",
            "image": "/skills/javaLogo.png"
        },
        {
            "name": "C++",
            "image": "/skills/c++Logo.png"
        },
        {
            "name": "C#",
            "image": "/skills/cSharpLogo.png"
        },
        {
            "name": "Kotlin",
            "image": "/skills/kotlinLogo.png"
        },
        {
            "name": "PHP",
            "image": "/skills/phpLogo.png"
        },
        {
            "name": "Bootstrap",
            "image": "/skills/bootstrapLogo.png"
        },
        {
            "name": "React",
            "image": "/skills/reactLogo.png"
        },
        {
            "name": "MySQL",
            "image": "/skills/mysqlLogo.png"
        }
    ],
    "education": [
        {
            "place": "Universidad Tecnológica Nacional",
            "title": "Ingeniería en Sistemas de información",
            "time": "2019 - Actualidad"
        },
        {
            "place": "Universidad Tecnológica Nacional",
            "title": "Tecnicatura Universitaria en programación",
            "time": "2022 - 2023 (Proyecto final a presentar)"
        }
    ],
    "proyects": [
        {
            "title":"Casino Roulette",
            "description": "Un pequeño juego hecho en React, donde simulamos una ruleta de casino perfectamente funcional. Utilicé Bootstrap para el layout.",
            "url" : "https://casino--roulette.vercel.app/",
            "image": "/proyects/casino.png"
        }
    ]
}
